In [1]:
import numpy as np
import pandas as pd

# column extract

In [11]:
c=pd.DataFrame({'numbers':[1,2,3,4],'letters':['a','b','c','d']})
c

   numbers letters
0        1       a
1        2       b
2        3       c
3        4       d

In [9]:
print(c['letters'])

0    a
1    b
2    c
3    d
Name: letters, dtype: object

# delete a column

In [12]:
del c['numbers']
c

  letters
0       a
1       b
2       c
3       d

# LOC Label Based Position

In [3]:
# creating a sample Dataframe
data={'Name':['Alice','Bob','Charlie','David'],
      'Age':[25,30,35,40],
      'City':['New York','Los Angeles','Chicago','Houston']}
df=pd.DataFrame(data,index=['A','B','C','D']) # Custom Index
# Display the DataFrame
print(df)

      Name  Age         City
A    Alice   25     New York
B      Bob   30  Los Angeles
C  Charlie   35      Chicago
D    David   40      Houston

In [15]:
# Selecting a single row using Label
print(df.loc['A'])

Name       Alice
Age           25
City    New York
Name: A, dtype: object

In [17]:
# Selecting Multiple rows using Label
print(df.loc[['A','B']])

    Name  Age         City
A  Alice   25     New York
B    Bob   30  Los Angeles

In [30]:
print(df.loc[:,['Name','Age']])

      Name  Age
A    Alice   25
B      Bob   30
C  Charlie   35
D    David   40

# ILOC Index Based Position

In [32]:
#Selecting a row using index
#print(df.loc['A'])
print(df.iloc[1])

Name            Bob
Age              30
City    Los Angeles
Name: B, dtype: object

In [33]:
# Selection multiple rows using index
print(df.iloc[0:])

      Name  Age         City
A    Alice   25     New York
B      Bob   30  Los Angeles
C  Charlie   35      Chicago
D    David   40      Houston

In [8]:
#Selecting row with specified coulumn using index
print(df.iloc[0:,[0,2]]) #0--only name and 2--city

      Name         City
A    Alice     New York
B      Bob  Los Angeles
C  Charlie      Chicago
D    David      Houston

# Data Group BY

In [16]:
x=pd.DataFrame({'Department':['Sales','Sales','IT','IT','Marketing','Marketing'],
                'Employee':['A','B','C','D','E','F'],
                'Salary':[1000,2000,5000,5000,3000,3000]})
x

  Department Employee  Salary
0      Sales        A    1000
1      Sales        B    2000
2         IT        C    5000
3         IT        D    5000
4  Marketing        E    3000
5  Marketing        F    3000

In [43]:
a=x.groupby('Department')['Salary'].sum()
a

Department
IT           10000
Marketing     6000
Sales         3000
Name: Salary, dtype: int64

In [18]:
b=x.groupby(['Department','Employee'])['Salary'].sum()
b

Department  Employee
IT          C           5000
            D           5000
Marketing   E           3000
            F           3000
Sales       A           1000
            B           2000
Name: Salary, dtype: int64

In [19]:
data={'Region':['East','West','East','North','West','East','North'],
      'Product':['A','A','B','A','B','B','B'],
      'Sales':[200,300,150,400,250,100,500]}
df=pd.DataFrame(data)
df

  Region Product  Sales
0   East       A    200
1   West       A    300
2   East       B    150
3  North       A    400
4   West       B    250
5   East       B    100
6  North       B    500

In [45]:
#Group BY 'Region'and 'Product' and summing sales
group_df=df.groupby(['Region','Product'])['Sales'].sum()
group_df

Region  Product
East    A          200
        B          250
North   A          400
        B          500
West    A          300
        B          250
Name: Sales, dtype: int64

# Multiple Aggregation

In [3]:
a=df.groupby('Region')['Sales'].agg(['sum','mean','max'])
a

        sum   mean  max
Region
East    450  150.0  200
North   900  450.0  500
West    550  275.0  300

In [5]:
b=df.groupby('Region')['Sales'].describe()
b

        count   mean        std    min    25%    50%    75%    max
Region
East      3.0  150.0  50.000000  100.0  125.0  150.0  175.0  200.0
North     2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
West      2.0  275.0  35.355339  250.0  262.5  275.0  287.5  300.0

In [18]:
c=df.groupby('Region')['Sales'].agg(lambda x:x.max()-x.min())
c

Region
East     100
North    100
West      50
Name: Sales, dtype: int64

In [23]:
df['Average']=df.groupby('Region')['Sales'].transform('mean')
df

  Region Product  Sales  Average
0   East       A    200    150.0
1   West       A    300    275.0
2   East       B    150    150.0
3  North       A    400    450.0
4   West       B    250    275.0
5   East       B    100    150.0
6  North       B    500    450.0

# filter the records where average sales is greater than 300

In [29]:
filter_data=df[df['Average']>300]
filter_data

  Region Product  Sales  Average
3  North       A    400    450.0
6  North       B    500    450.0

In [30]:
fd=df.groupby('Region').filter(lambda x:x['Sales'].mean()>300)
fd

  Region Product  Sales  Average
3  North       A    400    450.0
6  North       B    500    450.0

# Different aggregation on different columns

In [31]:
new=pd.DataFrame({'Product':[1,2,3,4,5,6],
                  'Category':['A','B','A','B','A','B'],
                  'Price':[10,20,30,40,50,60],
                  'Quantity':[2,1,2,1,2,1]})
new

   Product Category  Price  Quantity
0        1        A     10         2
1        2        B     20         1
2        3        A     30         2
3        4        B     40         1
4        5        A     50         2
5        6        B     60         1

In [32]:
e=new.groupby('Category').agg({'Price':'mean','Quantity':'sum'})
e

          Price  Quantity
Category
A          30.0         6
B          40.0         3

# With specified Heading

In [33]:
new=pd.DataFrame({'Student':[101,102,103,104,105],
                  'Class':['10A','10B','10A','10B','10A'],
                  'Score':[90,86,79,91,81]})
new

   Student Class  Score
0      101   10A     90
1      102   10B     86
2      103   10A     79
3      104   10B     91
4      105   10A     81

In [35]:
a=new.groupby('Class').agg(Maximum_Score=('Score','max'),Minimum_score=('Score','min'))
a

       Maximum_Score  Minimum_score
Class
10A               90             79
10B               91             86